TF.org
#+title: TensorFlow
#+INCLUDE: ../pdf.org
#+TAGS: AI
#+OPTIONS: toc:2 ^:nil num:5
#+PROPERTY: header-args :eval never-export
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/white.css" />
#+EXCLUDE_TAGS: noexport
#+latex:\newpage

* TensorFlow簡介
** 簡介
[[https://www.tensorflow.org/tutorials/generative/adversarial_fgsm][官網學習資源]]
是 Google 繼 2011 年開發了 DistBelief 之後的產品，最初由 Google Brain Team 團隊開發，Google 使用 TensorFlow 進行研究及自身產品開發，並於 2015 年 11 月開放原始碼。Google 的 TensorFlow 產品應用包括 GMail 垃圾郵件過濾、Google 語音辨識、Google 圖像辨識、Google 翻譯等等。

TensorFlow 可以在 CPU、GPU、TPU(Tensor Processing Unit，由 google 為 AI 研發的專屬晶片)上執行，此外，TensorFlow 也有極佳的跨平台能力，可以在不修改程式碼的前題下，於下列平台上執行訓練，包括：Windows、Linux、iOS、Android、Raspberry Pi。

TensorFlow 為較低階的深度學習 API，所以模型必須自行設計，包括張量乘積、卷積等底層操作也要自行撰寫，優點是可以自行規劃模型內容，缺點是開發需要更多時間。所有，有許多開發商以 TensorFlow 為底層開發了許多高階 API，如：Keras、TF-Learn、TF-Slim、TF-Layer。

透過使用資料流(flow)圖像，來進行數值演算的新一代開源機器學習工具。這個機器學習工具的基礎設計，主要透過圖學裡的「節點」來表達數學運算，「邊」來表示「節點」間的多維度資料陣列 (tensors，張量)，因此命名做 TensorFlow。

TensorFlow 的設計模式核心為「計算圖」(computational graph)，可分為建立計算圖與執行計算圖兩個部份，其程式架構大致如下。

#+BEGIN_SRC python -r -n :results output :exports both
  import tensorflow as tf
  import numpy as np
  '''1. 建立計算圖'''
  W = tf.Variable(tf.random_normal([3, 2]), name='W')
  b = tf.Variable(tf.random_normal([1, 2]), name='b')
  X = tf.placeholder("float", [None,3], name='X')
  y = tf.nn.sigmoid(tf.matmul(X,W)+b, 'y')
  '''2. 執行計算圖'''
  with tf.Session() as sess:
      init= tf.global_variables_initializer()
      sess.run(init)
      X_array = np.array([[0.4, 0.2, 0.4],
                          [0.3, 0.4, 0.5],
                          [0.3, -0.4, 0.5]])
      (_b,_W,_X,_y) = sess.run((b,W,X,y), feed_dict={X:X_array})

  print(_b)
  print(_W)
  print(_X)
  print(_y)
#+END_SRC

#+RESULTS:
#+begin_example
[[-0.28260672  2.0333097 ]]
[[-1.5098639   0.07314453]
 [ 0.5849383   1.2003893 ]
 [ 1.8941628   0.44426546]]
[[ 0.4  0.2  0.4]
 [ 0.3  0.4  0.5]
 [ 0.3 -0.4  0.5]]
[[0.49702516 0.92275286]
 [0.60956657 0.9403379 ]
 [0.4943853  0.8578114 ]]
#+end_example
** 為何不用 sklearn
- [[file:AI-Introduction.org][AI Introduction]]
- sklearn 不能跑 GPU
** Converting TF 1.0 code to 2.0
若在 colab 則於最前面加!
#+begin_src shell -r -n :results output :exports both
# simple script converts TF 1.0 code to TF 2.0 code !tf_upgrade_v2 --infile
tf_upgrade_v2 --infile tf_1_code.py tf2_code.py
#+end_src
** 學習資源
- [[https://www.tensorflow.org/tutorials][官方教學網站]]

* 安裝
** windows 10
1. download python3
1. download CUDA 9/10
1. download and setup cuDNN

* Tenser運算原理

一個 TensorFlow 的基礎數值運算需要三個步驟：
1. 宣告張量為常數
TensorFlow 的基本運算單位是張量（Tensor），張量的維度可以是零（零維張量更常見的名稱是純量，Scalar） 、可以是 1（1 維張量更常見的名稱是向量，Vector）、可以是 2（2 維張量更常見的名稱是矩陣，Matrix）亦可以為 n（n 維張量），這個設計與 NumPy 中 ndarray 不謀而合，對於熟悉 NumPy 的 Python 使用者是一大福音。
1. 宣告數值運算的公式
基礎的數值運算（四則運算、次方、求餘數或求商數等）都有 TensorFlow 的函數可以呼叫。
- 相加 +：tf.add()
- 相減 -： tf.sub()
- 相乘 *： tf.multiply()
- 相除 /： tf.divide()
- 次方 **： tf.pow()
- 求餘數 %： tf.mod()
- 求商數 //：tf.div()
與 Python 數值運算不同的是，這些函數都必須在 TensorFlow 的 Session 中執行才會有運算結果的輸出，否則只是顯示張量物件的資訊而已。
1. 以 Session 執行數值運算
利用 tf.Session() 建立 Session 後再執行數值運算是正規的 TensorFlow 寫法，但對於慣用 Jupyter Notebook 的資料科學家可能會略嫌麻煩，這時可以選擇以 tf.InteractiveSession() 互動模式啟動 Session，一但設定為互動模式後，執行運算變為呼叫張量的 .eval() 方法，並記得在使用完畢之後呼叫 Session 的 .close() 方法關閉互動模式。

