TF.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-04 Mon 09:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TensorFlow</title>
<meta name="author" content="Yung-Chin Yen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/white.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">TensorFlow</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org15bc269">1. TensorFlow簡介</a>
<ul>
<li><a href="#orgd0253c0">1.1. 簡介</a></li>
<li><a href="#org4e62d15">1.2. 為何不用 sklearn</a></li>
<li><a href="#org1000338">1.3. Converting TF 1.0 code to 2.0</a></li>
<li><a href="#org068a27a">1.4. 學習資源</a></li>
</ul>
</li>
<li><a href="#org006e4d6">2. 安裝</a>
<ul>
<li><a href="#orgc102960">2.1. windows 10</a></li>
</ul>
</li>
<li><a href="#org2813738">3. Tenser運算原理</a>
<ul>
<li><a href="#org97a8a68">3.1. 常用的常數向量建構函數</a></li>
<li><a href="#orga69b868">3.2. 常用的矩陣建構與計算函數</a></li>
<li><a href="#orgf25c1e5">3.3. 變數</a></li>
<li><a href="#orgf73a8f4">3.4. Placeholder</a></li>
<li><a href="#orgefef920">3.5. placeholder 與 variable 的差異</a></li>
</ul>
</li>
<li><a href="#org7fcdb8c">4. TenserBoard</a></li>
<li><a href="#orgc402197">5. 情緒分析 sentiment analysis</a></li>
<li><a href="#org012daa4">6. IMDb-Movie-Review</a></li>
<li><a href="#orgcce8920">7. 使用 XLNet(2019)</a></li>
<li><a href="#orgcc69889">8. Basic</a>
<ul>
<li><a href="#org2106ce2">8.1. Tensors</a></li>
</ul>
</li>
<li><a href="#orgbbb3db8">9. Prediction:</a>
<ul>
<li><a href="#orga62126f">9.1. Classification</a></li>
<li><a href="#orgf9b4cc0">9.2. Numeric Prediction</a></li>
</ul>
</li>
<li><a href="#orgc84e1a9">10. Classification two steps</a></li>
<li><a href="#orgadef8c0">11. 分類演算法</a></li>
<li><a href="#org13e7173">12. Unsupervised Learning</a>
<ul>
<li><a href="#org9397934">12.1. Cluster Analysis</a></li>
<li><a href="#org4b12335">12.2. Algorithms</a></li>
</ul>
</li>
<li><a href="#org89f2119">13. 類神經網路</a>
<ul>
<li><a href="#orgbc8369c">13.1. preceptron</a></li>
<li><a href="#orgf3ef254">13.2. Activation</a></li>
<li><a href="#orgef0cf14">13.3. AND gate 實作</a></li>
<li><a href="#org6f00674">13.4. Or gate 實作</a></li>
<li><a href="#orgea302d7">13.5. 重要關鍵</a></li>
<li><a href="#org67d4507">13.6. 具有學習能力的類神經網路</a></li>
</ul>
</li>
<li><a href="#org0200013">14. 神經網路的基本步驟</a>
<ul>
<li><a href="#orgb151524">14.1. 如何計算誤差</a></li>
<li><a href="#org14398ca">14.2. 類神經網路的 Back-Propagation</a></li>
</ul>
</li>
<li><a href="#orgbd610e4">15. 梯度下降法</a></li>
<li><a href="#org3c5583c">16. 優化器演算法</a></li>
<li><a href="#orgefade04">17. Tensorflow</a>
<ul>
<li><a href="#orgaa601ac">17.1. Tensor 資料型別</a></li>
<li><a href="#org9f0b96b">17.2. Tensorflow 教材</a></li>
</ul>
</li>
<li><a href="#org86a7679">18. Keras</a>
<ul>
<li><a href="#orgdbc82bf">18.1. 如何判斷 Keras</a></li>
<li><a href="#org9938ef1">18.2. steps</a></li>
<li><a href="#orga73917d">18.3. tensorflow 開發三種模式</a></li>
<li><a href="#org59853c7">18.4. Model class API</a></li>
<li><a href="#org8a67818">18.5. 用 Keras 來做剛剛的迴歸</a></li>
<li><a href="#orgf8c3003">18.6. 何時用 function 式的寫法</a></li>
<li><a href="#orgce4ffaf">18.7. kernel density</a></li>
</ul>
</li>
<li><a href="#org48387d5">19. 20200613 #2/3</a>
<ul>
<li><a href="#org8b05828">19.1. 版本差異</a></li>
<li><a href="#orgad9873c">19.2. 閱讀 Tensorflow</a></li>
<li><a href="#orgcf9b522">19.3. TensorFlow Hub</a></li>
</ul>
</li>
<li><a href="#orgca5bfd6">20. tf.data</a>
<ul>
<li><a href="#org81cb5b1">20.1. 資料預處理: tf.data.Dataset API</a></li>
<li><a href="#orgae306f7">20.2. TensorFlow 能接受的資料輸入(如圖片大小及色階)有固定</a></li>
</ul>
</li>
<li><a href="#org8fff5d4">21. Data is the king</a>
<ul>
<li><a href="#org5d675c6">21.1. 資料太少？</a></li>
<li><a href="#org1a12e46">21.2. 過度擬合</a></li>
</ul>
</li>
<li><a href="#org097d9c0">22. homework</a></li>
<li><a href="#org56e3d44">23. 比賽可以出的題目</a></li>
<li><a href="#orgdf2b5a6">24. 感知機(Perceptron)</a></li>
<li><a href="#org1f28df9">25. RNN</a>
<ul>
<li><a href="#org3397c3b">25.1. Sequential pattern</a></li>
</ul>
</li>
<li><a href="#orgfad024d">26. Book: Deep Learning</a></li>
</ul>
</div>
</div>

<div id="outline-container-org15bc269" class="outline-2">
<h2 id="org15bc269"><span class="section-number-2">1.</span> TensorFlow簡介</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd0253c0" class="outline-3">
<h3 id="orgd0253c0"><span class="section-number-3">1.1.</span> 簡介</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://www.tensorflow.org/tutorials/generative/adversarial_fgsm">官網學習資源</a><br />
是 Google 繼 2011 年開發了 DistBelief 之後的產品，最初由 Google Brain Team 團隊開發，Google 使用 TensorFlow 進行研究及自身產品開發，並於 2015 年 11 月開放原始碼。Google 的 TensorFlow 產品應用包括 GMail 垃圾郵件過濾、Google 語音辨識、Google 圖像辨識、Google 翻譯等等。<br />
</p>

<p>
TensorFlow 可以在 CPU、GPU、TPU(Tensor Processing Unit，由 google 為 AI 研發的專屬晶片)上執行，此外，TensorFlow 也有極佳的跨平台能力，可以在不修改程式碼的前題下，於下列平台上執行訓練，包括：Windows、Linux、iOS、Android、Raspberry Pi。<br />
</p>

<p>
TensorFlow 為較低階的深度學習 API，所以模型必須自行設計，包括張量乘積、卷積等底層操作也要自行撰寫，優點是可以自行規劃模型內容，缺點是開發需要更多時間。所有，有許多開發商以 TensorFlow 為底層開發了許多高階 API，如：Keras、TF-Learn、TF-Slim、TF-Layer。<br />
</p>

<p>
透過使用資料流(flow)圖像，來進行數值演算的新一代開源機器學習工具。這個機器學習工具的基礎設計，主要透過圖學裡的「節點」來表達數學運算，「邊」來表示「節點」間的多維度資料陣列 (tensors，張量)，因此命名做 TensorFlow。<br />
</p>

<p>
TensorFlow 的設計模式核心為「計算圖」(computational graph)，可分為建立計算圖與執行計算圖兩個部份，其程式架構大致如下。<br />
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span>  <span style="color: #51afef;">import</span> tensorflow <span style="color: #51afef;">as</span> tf
<span class="linenr"> 2: </span>  <span style="color: #51afef;">import</span> numpy <span style="color: #51afef;">as</span> np
<span class="linenr"> 3: </span>  <span style="color: #98be65;">'''1. &#24314;&#31435;&#35336;&#31639;&#22294;'''</span>
<span class="linenr"> 4: </span>  <span style="color: #dcaeea;">W</span> = tf.Variable(tf.random_normal([<span style="color: #da8548; font-weight: bold;">3</span>, <span style="color: #da8548; font-weight: bold;">2</span>]), name=<span style="color: #98be65;">'W'</span>)
<span class="linenr"> 5: </span>  b = tf.Variable(tf.random_normal([<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span>]), name=<span style="color: #98be65;">'b'</span>)
<span class="linenr"> 6: </span>  X = tf.placeholder(<span style="color: #98be65;">"float"</span>, [<span style="color: #a9a1e1;">None</span>,<span style="color: #da8548; font-weight: bold;">3</span>], name=<span style="color: #98be65;">'X'</span>)
<span class="linenr"> 7: </span>  y = tf.nn.sigmoid(tf.matmul(X,W)+b, <span style="color: #98be65;">'y'</span>)
<span class="linenr"> 8: </span>  <span style="color: #83898d;">'''2. &#22519;&#34892;&#35336;&#31639;&#22294;'''</span>
<span class="linenr"> 9: </span>  <span style="color: #51afef;">with</span> tf.Session() <span style="color: #51afef;">as</span> sess:
<span class="linenr">10: </span>      init= tf.global_variables_initializer()
<span class="linenr">11: </span>      sess.run(init)
<span class="linenr">12: </span>      X_array = np.array([[<span style="color: #da8548; font-weight: bold;">0.4</span>, <span style="color: #da8548; font-weight: bold;">0.2</span>, <span style="color: #da8548; font-weight: bold;">0.4</span>],
<span class="linenr">13: </span>                          [<span style="color: #da8548; font-weight: bold;">0.3</span>, <span style="color: #da8548; font-weight: bold;">0.4</span>, <span style="color: #da8548; font-weight: bold;">0.5</span>],
<span class="linenr">14: </span>                          [<span style="color: #da8548; font-weight: bold;">0.3</span>, -<span style="color: #da8548; font-weight: bold;">0.4</span>, <span style="color: #da8548; font-weight: bold;">0.5</span>]])
<span class="linenr">15: </span>      (<span style="color: #dcaeea;">_b</span>,<span style="color: #dcaeea;">_W</span>,<span style="color: #dcaeea;">_X</span>,<span style="color: #dcaeea;">_y</span>) = sess.run((b,W,X,y), feed_dict={X:X_array})
<span class="linenr">16: </span>
<span class="linenr">17: </span>  <span style="color: #c678dd;">print</span>(_b)
<span class="linenr">18: </span>  <span style="color: #c678dd;">print</span>(_W)
<span class="linenr">19: </span>  <span style="color: #c678dd;">print</span>(_X)
<span class="linenr">20: </span>  <span style="color: #c678dd;">print</span>(_y)
</pre>
</div>

<pre class="example" id="orgd6ce0c8">
[[-0.28260672  2.0333097 ]]
[[-1.5098639   0.07314453]
 [ 0.5849383   1.2003893 ]
 [ 1.8941628   0.44426546]]
[[ 0.4  0.2  0.4]
 [ 0.3  0.4  0.5]
 [ 0.3 -0.4  0.5]]
[[0.49702516 0.92275286]
 [0.60956657 0.9403379 ]
 [0.4943853  0.8578114 ]]
</pre>
</div>
</div>
<div id="outline-container-org4e62d15" class="outline-3">
<h3 id="org4e62d15"><span class="section-number-3">1.2.</span> 為何不用 sklearn</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="AI-Introduction.html">AI Introduction</a><br /></li>
<li>sklearn 不能跑 GPU<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org1000338" class="outline-3">
<h3 id="org1000338"><span class="section-number-3">1.3.</span> Converting TF 1.0 code to 2.0</h3>
<div class="outline-text-3" id="text-1-3">
<p>
若在 colab 則於最前面加!<br />
</p>
<div class="org-src-container">
<pre class="src src-shell"><span class="linenr">1: </span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">simple script converts TF 1.0 code to TF 2.0 code !tf_upgrade_v2 --infile</span>
<span class="linenr">2: </span>tf_upgrade_v2 --infile tf_1_code.py tf2_code.py
</pre>
</div>
</div>
</div>
<div id="outline-container-org068a27a" class="outline-3">
<h3 id="org068a27a"><span class="section-number-3">1.4.</span> 學習資源</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><a href="https://www.tensorflow.org/tutorials">官方教學網站</a><br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org006e4d6" class="outline-2">
<h2 id="org006e4d6"><span class="section-number-2">2.</span> 安裝</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc102960" class="outline-3">
<h3 id="orgc102960"><span class="section-number-3">2.1.</span> windows 10</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>download python3<br /></li>
<li>download CUDA 9/10<br /></li>
<li>download and setup cuDNN<br /></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org2813738" class="outline-2">
<h2 id="org2813738"><span class="section-number-2">3.</span> Tenser運算原理</h2>
<div class="outline-text-2" id="text-3">
<p>
一個 TensorFlow 的基礎數值運算需要三個步驟：<br />
</p>
<ol class="org-ol">
<li>宣告張量為常數<br /></li>
</ol>
<p>
TensorFlow 的基本運算單位是張量（Tensor），張量的維度可以是零（零維張量更常見的名稱是純量，Scalar） 、可以是 1（1 維張量更常見的名稱是向量，Vector）、可以是 2（2 維張量更常見的名稱是矩陣，Matrix）亦可以為 n（n 維張量），這個設計與 NumPy 中 ndarray 不謀而合，對於熟悉 NumPy 的 Python 使用者是一大福音。<br />
</p>
<ol class="org-ol">
<li>宣告數值運算的公式<br /></li>
</ol>
<p>
基礎的數值運算（四則運算、次方、求餘數或求商數等）都有 TensorFlow 的函數可以呼叫。<br />
</p>
<ul class="org-ul">
<li>相加 +：tf.add()<br /></li>
<li>相減 -： tf.sub()<br /></li>
<li>相乘 *： tf.multiply()<br /></li>
<li>相除 /： tf.divide()<br /></li>
<li>次方 **： tf.pow()<br /></li>
<li>求餘數 %： tf.mod()<br /></li>
<li>求商數 //：tf.div()<br /></li>
</ul>
<p>
與 Python 數值運算不同的是，這些函數都必須在 TensorFlow 的 Session 中執行才會有運算結果的輸出，否則只是顯示張量物件的資訊而已。<br />
</p>
<ol class="org-ol">
<li>以 Session 執行數值運算<br /></li>
</ol>
<p>
利用 tf.Session() 建立 Session 後再執行數值運算是正規的 TensorFlow 寫法，但對於慣用 Jupyter Notebook 的資料科學家可能會略嫌麻煩，這時可以選擇以 tf.InteractiveSession() 互動模式啟動 Session，一但設定為互動模式後，執行運算變為呼叫張量的 .eval() 方法，並記得在使用完畢之後呼叫 Session 的 .close() 方法關閉互動模式。<br />
</p>
</div>
