TF.org
** 常用的常數向量建構函數
除了使用 tf.constant() 創造常數張量以外，常用的建構函數有：
1. tf.zeros() ：建構內容數值皆為 0 的常數張量
1. tf.ones() ：建構內容數值皆為 1 的常數張量
1. tf.fill() ：建構內容數值皆為特定值的常數張量
1. tf.range() ：建構內容數值為 (start, limit, delta) 數列的常數張量
1. tf.random_normal() ：建構內容數值為符合常態分佈數列的常數張量
1. tf.random_uniform() ：建構內容數值為符合均勻分佈數列的常數張量
** 常用的矩陣建構與計算函數
TensorFlow 的二維張量與 NumPy 的二維陣列相同為矩陣提供了各種方便使用者呼叫的建構、運算函數，而矩陣亦是 NumPy 與 TensorFlow 應用實務中最常被使用的類型，而常用的矩陣建構與計算函數有：
1. tf.reshape() ：調整矩陣外觀
1. tf.eye() ：建構單位矩陣
1. tf.diag() ：建構對角矩陣
1. tf.matrix_transpose() ：轉置矩陣
1. tf.matmul() ：矩陣相乘
** 變數
雖然以常數進行數值運算很方便，但就如同在程式設計中不可能永遠只倚賴值（Values）一般，常見的情況是為了保持彈性，必須將值宣告賦值給變數（Variables）讓使用者能夠動態地進行相同的計算來得到不同的結果，這在 TensorFlow 中是以 tf.Variable() 來完成，就像是在 Python 中簡單宣告變數一般。

不過在 TensorFlow 的觀念之中，宣告變數張量並不如 Python 或者先前宣告常數張量那麼單純，它需要兩個步驟：
1. 宣告變數張量的初始值、類型與外觀
1. 初始化變數張量
如果宣告的變數張量沒有經過初始化，我們將會得到

該如何初始化變數張量呢？只需將變數張量的 initializer 屬性放入 Session 中執行即可。初始化成功後的變數張量，可以透過 .assign() 方法賦予不同值。
值得注意的地方是對變數張量重新賦値這件事對 TensorFlow 來說也是一個運算，必須在宣告之後放入 Session 中執行，否則重新賦值並不會有作用。變數張量一但被宣告之後，重新賦值時必須要注意類型，賦予不同類型的值會得到 TypeError。不僅是值的類型，外觀也必須跟當初所宣告的相同，賦予不同外觀的值會得到 ValueError。
** Placeholder

第三種在 TensorFlow 中張量將被宣告的類型稱為 Placeholder，這是一種常見將資料輸入 TensorFlow 計算圖形（Graph）的方法，我們可以將它對照為像是在佔有一個長度卻沒有初始值的 Python None、或者是 NumPy np.NaN ，差異在於 None 或 np.NaN 不需要將之後想要擺放的資料類型預先定義，但是 Placeholder 張量和變數張量一樣，必須預先定義好之後欲輸入的資料類型與外觀。使用 tf.placeholder() 可以建出 Placeholder 張量，未來利用 TensorFlow 訓練機器學習與深度學習的模型時，將會使用 Placeholder 將 X 與 y 的資料輸入計算圖形。
那麼宣告完 Placeholder 張量以後，又該如何將資料輸入？TensorFlow 的術語稱作是 Feed dictionaries，意即將資料以 Python dict 餵進（Feed）Placeholder 張量之中，而 TensorFlow 術語則將完成計算後的輸出資料稱作是 Fetch，是 ndarray 的類型。
Placeholder 張量具備隱性型別轉換的功能，假如我們用浮點數餵入已經被宣告為 tf.int32 的 Placeholder 張量中，將會被自動轉換為整數。假如餵入資料外觀與 Placeholder 張量所定義的不同，則會產生錯誤。
** placeholder 與 variable 的差異
The difference is that with tf.Variable you have to provide an initial value when you declare it. With tf.placeholder you don't have to provide an initial value and you can specify it at run time with the feed_dict argument inside Session.run

* TenserBoard
TensorFlow 的開發團隊提供了 TensorBoard 應用程式可以在本機端啟動網頁伺服器，並在其中顯示 TensorFlow 程式的相關視覺化，若希望能夠在 TensorBoard 中檢視，必須手動在 TensorFlow 程式中加入 tf.summary.FileWriter() 來指定 TensorBoard 儲存日誌的檔案路徑，例如寫作一個簡單的張量相加運算，並將這個運算記錄在 graphs/tf_add 資料夾中。

接著回到終端機，在啟動 Jupyter Notebook 的路徑下執行指令啟動 TensorBoard 服務，並指定日誌儲存的檔案路徑 --logdir=graphs/tf_add 以及 TensorBoard 網頁伺服器的啟動位址（本機位址 localhost） --host=127.0.0.1 。

最後打開瀏覽器在網址列輸入 127.0.0.1:6006 就可以瀏覽 TensorBoard 的服務內容，點選 GRAPHS 標籤就可以觀察一個張量相加運算在 TensorBoard 的視覺化。

檢視完畢之後可以回到終端機畫面以 CTRL-C 終止 TensorBoard 服務。

* 情緒分析 sentiment analysis

https://github.com/MyDearGreatTeacher/TensorSecurity/blob/master/code/TF/RNN/%E7%AF%84%E4%BE%8B%E7%A8%8B%E5%BC%8F_%E6%83%85%E7%B7%92%E5%88%86%E6%9E%90sentiment%20analysis.md

* IMDb-Movie-Review

* 使用 XLNet(2019)


#+latex:\newpage


* Basic
** Tensors
*** Creating Tensors
#+begin_src python -r -n :results output :exports both
import tensorflow as tf

string = tf.Variable(["This is a string"], tf.string)
number = tf.Variable(9527, tf.int16)
floating = tf.Variable(3.141592, tf.float64)

print(string)
print(number)
print(floating.v)
#+end_src

#+RESULTS:

* Prediction:
** Classification
- Decision tree
- Ensemble Methods: 整合/集成/, bagging, boosting
** Numeric Prediction

* Classification two steps
1. process 1: Model construction
1. process 2: Using the Model in prediction

* 分類演算法
- 評估指標
- 作業：找出有漏洞程式碼資料集(有 Label 的)，找 Metrics 評估指標

* Unsupervised Learning
** Cluster Analysis
** Algorithms

* 類神經網路
** preceptron
- Weight
-  Bias
- Activation function
** Activation
哪一種 function 最好：跑出來有效的就是好的
- Sigmoid function
- tanh
- ReLU
- Leaky ReLU
** AND gate 實作
#+begin_src python -r -n :results output :exports both
# coding: utf-8
import numpy as np
3
def AND(x1, x2):
    x = np.array([x1, x2])
    w = np.array([0.5, 0.5])
    b = -0.7
    tmp = np.sum(w*x) + b
    if tmp <= 0:
        return 0
    else:
        return 1

if __name__ == '__main__':
    for xs in [(0, 0), (1, 0), (0, 1), (1, 1)]:
        y = AND(xs[0], xs[1])
        print(str(xs) + " -> " + str(y))
#+end_src

#+RESULTS:
: (0, 0) -> 0
: (1, 0) -> 0
: (0, 1) -> 0
: (1, 1) -> 1
** Or gate 實作
#+begin_src python -r -n :results output :exports both
# coding: utf-8
import numpy as np

def OR(x1, x2):
    x = np.array([x1, x2])
    w = np.array([0.5, 0.5])
    b = -0.3
    tmp = np.sum(w*x) + b
    if tmp <= 0:
        return 0
    else:
        return 1

if __name__ == '__main__':
    for xs in [(0, 0), (1, 0), (0, 1), (1, 1)]:
        y = OR(xs[0], xs[1])
        print(str(xs) + " -> " + str(y))

#+end_src

#+RESULTS:
: (0, 0) -> 0
: (1, 0) -> 1
: (0, 1) -> 1
: (1, 1) -> 1

