TF.html

<div id="outline-container-org97a8a68" class="outline-3">
<h3 id="org97a8a68"><span class="section-number-3">3.1.</span> 常用的常數向量建構函數</h3>
<div class="outline-text-3" id="text-3-1">
<p>
除了使用 tf.constant() 創造常數張量以外，常用的建構函數有：<br />
</p>
<ol class="org-ol">
<li>tf.zeros() ：建構內容數值皆為 0 的常數張量<br /></li>
<li>tf.ones() ：建構內容數值皆為 1 的常數張量<br /></li>
<li>tf.fill() ：建構內容數值皆為特定值的常數張量<br /></li>
<li>tf.range() ：建構內容數值為 (start, limit, delta) 數列的常數張量<br /></li>
<li>tf.random_normal() ：建構內容數值為符合常態分佈數列的常數張量<br /></li>
<li>tf.random_uniform() ：建構內容數值為符合均勻分佈數列的常數張量<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orga69b868" class="outline-3">
<h3 id="orga69b868"><span class="section-number-3">3.2.</span> 常用的矩陣建構與計算函數</h3>
<div class="outline-text-3" id="text-3-2">
<p>
TensorFlow 的二維張量與 NumPy 的二維陣列相同為矩陣提供了各種方便使用者呼叫的建構、運算函數，而矩陣亦是 NumPy 與 TensorFlow 應用實務中最常被使用的類型，而常用的矩陣建構與計算函數有：<br />
</p>
<ol class="org-ol">
<li>tf.reshape() ：調整矩陣外觀<br /></li>
<li>tf.eye() ：建構單位矩陣<br /></li>
<li>tf.diag() ：建構對角矩陣<br /></li>
<li>tf.matrix_transpose() ：轉置矩陣<br /></li>
<li>tf.matmul() ：矩陣相乘<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgf25c1e5" class="outline-3">
<h3 id="orgf25c1e5"><span class="section-number-3">3.3.</span> 變數</h3>
<div class="outline-text-3" id="text-3-3">
<p>
雖然以常數進行數值運算很方便，但就如同在程式設計中不可能永遠只倚賴值（Values）一般，常見的情況是為了保持彈性，必須將值宣告賦值給變數（Variables）讓使用者能夠動態地進行相同的計算來得到不同的結果，這在 TensorFlow 中是以 tf.Variable() 來完成，就像是在 Python 中簡單宣告變數一般。<br />
</p>

<p>
不過在 TensorFlow 的觀念之中，宣告變數張量並不如 Python 或者先前宣告常數張量那麼單純，它需要兩個步驟：<br />
</p>
<ol class="org-ol">
<li>宣告變數張量的初始值、類型與外觀<br /></li>
<li>初始化變數張量<br /></li>
</ol>
<p>
如果宣告的變數張量沒有經過初始化，我們將會得到<br />
</p>

<p>
該如何初始化變數張量呢？只需將變數張量的 initializer 屬性放入 Session 中執行即可。初始化成功後的變數張量，可以透過 .assign() 方法賦予不同值。<br />
值得注意的地方是對變數張量重新賦値這件事對 TensorFlow 來說也是一個運算，必須在宣告之後放入 Session 中執行，否則重新賦值並不會有作用。變數張量一但被宣告之後，重新賦值時必須要注意類型，賦予不同類型的值會得到 TypeError。不僅是值的類型，外觀也必須跟當初所宣告的相同，賦予不同外觀的值會得到 ValueError。<br />
</p>
</div>
</div>
<div id="outline-container-orgf73a8f4" class="outline-3">
<h3 id="orgf73a8f4"><span class="section-number-3">3.4.</span> Placeholder</h3>
<div class="outline-text-3" id="text-3-4">
<p>
第三種在 TensorFlow 中張量將被宣告的類型稱為 Placeholder，這是一種常見將資料輸入 TensorFlow 計算圖形（Graph）的方法，我們可以將它對照為像是在佔有一個長度卻沒有初始值的 Python None、或者是 NumPy np.NaN ，差異在於 None 或 np.NaN 不需要將之後想要擺放的資料類型預先定義，但是 Placeholder 張量和變數張量一樣，必須預先定義好之後欲輸入的資料類型與外觀。使用 tf.placeholder() 可以建出 Placeholder 張量，未來利用 TensorFlow 訓練機器學習與深度學習的模型時，將會使用 Placeholder 將 X 與 y 的資料輸入計算圖形。<br />
那麼宣告完 Placeholder 張量以後，又該如何將資料輸入？TensorFlow 的術語稱作是 Feed dictionaries，意即將資料以 Python dict 餵進（Feed）Placeholder 張量之中，而 TensorFlow 術語則將完成計算後的輸出資料稱作是 Fetch，是 ndarray 的類型。<br />
Placeholder 張量具備隱性型別轉換的功能，假如我們用浮點數餵入已經被宣告為 tf.int32 的 Placeholder 張量中，將會被自動轉換為整數。假如餵入資料外觀與 Placeholder 張量所定義的不同，則會產生錯誤。<br />
</p>
</div>
</div>
<div id="outline-container-orgefef920" class="outline-3">
<h3 id="orgefef920"><span class="section-number-3">3.5.</span> placeholder 與 variable 的差異</h3>
<div class="outline-text-3" id="text-3-5">
<p>
The difference is that with tf.Variable you have to provide an initial value when you declare it. With tf.placeholder you don&rsquo;t have to provide an initial value and you can specify it at run time with the feed_dict argument inside Session.run<br />
</p>
</div>
</div>
</div>

<div id="outline-container-org7fcdb8c" class="outline-2">
<h2 id="org7fcdb8c"><span class="section-number-2">4.</span> TenserBoard</h2>
<div class="outline-text-2" id="text-4">
<p>
TensorFlow 的開發團隊提供了 TensorBoard 應用程式可以在本機端啟動網頁伺服器，並在其中顯示 TensorFlow 程式的相關視覺化，若希望能夠在 TensorBoard 中檢視，必須手動在 TensorFlow 程式中加入 tf.summary.FileWriter() 來指定 TensorBoard 儲存日誌的檔案路徑，例如寫作一個簡單的張量相加運算，並將這個運算記錄在 graphs/tf_add 資料夾中。<br />
</p>

<p>
接著回到終端機，在啟動 Jupyter Notebook 的路徑下執行指令啟動 TensorBoard 服務，並指定日誌儲存的檔案路徑 &#x2013;logdir=graphs/tf_add 以及 TensorBoard 網頁伺服器的啟動位址（本機位址 localhost） &#x2013;host=127.0.0.1 。<br />
</p>

<p>
最後打開瀏覽器在網址列輸入 127.0.0.1:6006 就可以瀏覽 TensorBoard 的服務內容，點選 GRAPHS 標籤就可以觀察一個張量相加運算在 TensorBoard 的視覺化。<br />
</p>

<p>
檢視完畢之後可以回到終端機畫面以 CTRL-C 終止 TensorBoard 服務。<br />
</p>
</div>
</div>

<div id="outline-container-orgc402197" class="outline-2">
<h2 id="orgc402197"><span class="section-number-2">5.</span> 情緒分析 sentiment analysis</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://github.com/MyDearGreatTeacher/TensorSecurity/blob/master/code/TF/RNN/%E7%AF%84%E4%BE%8B%E7%A8%8B%E5%BC%8F_%E6%83%85%E7%B7%92%E5%88%86%E6%9E%90sentiment%20analysis.md">https://github.com/MyDearGreatTeacher/TensorSecurity/blob/master/code/TF/RNN/%E7%AF%84%E4%BE%8B%E7%A8%8B%E5%BC%8F_%E6%83%85%E7%B7%92%E5%88%86%E6%9E%90sentiment%20analysis.md</a><br />
</p>
</div>
</div>

<div id="outline-container-org012daa4" class="outline-2">
<h2 id="org012daa4"><span class="section-number-2">6.</span> IMDb-Movie-Review</h2>
</div>

<div id="outline-container-orgcce8920" class="outline-2">
<h2 id="orgcce8920"><span class="section-number-2">7.</span> 使用 XLNet(2019)</h2>
<div class="outline-text-2" id="text-7">
</div>
</div>


<div id="outline-container-orgcc69889" class="outline-2">
<h2 id="orgcc69889"><span class="section-number-2">8.</span> Basic</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org2106ce2" class="outline-3">
<h3 id="org2106ce2"><span class="section-number-3">8.1.</span> Tensors</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<ol class="org-ol">
<li><a id="org5855661"></a>Creating Tensors<br />
<div class="outline-text-4" id="text-8-1-1">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr">1: </span><span style="color: #51afef;">import</span> tensorflow <span style="color: #51afef;">as</span> tf
<span class="linenr">2: </span>
<span class="linenr">3: </span><span style="color: #dcaeea;">string</span> = tf.Variable([<span style="color: #98be65;">"This is a string"</span>], tf.string)
<span class="linenr">4: </span><span style="color: #dcaeea;">number</span> = tf.Variable(<span style="color: #da8548; font-weight: bold;">9527</span>, tf.int16)
<span class="linenr">5: </span><span style="color: #dcaeea;">floating</span> = tf.Variable(<span style="color: #da8548; font-weight: bold;">3.141592</span>, tf.float64)
<span class="linenr">6: </span>
<span class="linenr">7: </span><span style="color: #c678dd;">print</span>(string)
<span class="linenr">8: </span><span style="color: #c678dd;">print</span>(number)
<span class="linenr">9: </span><span style="color: #c678dd;">print</span>(floating.v)
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgbbb3db8" class="outline-2">
<h2 id="orgbbb3db8"><span class="section-number-2">9.</span> Prediction:</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orga62126f" class="outline-3">
<h3 id="orga62126f"><span class="section-number-3">9.1.</span> Classification</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>Decision tree<br /></li>
<li>Ensemble Methods: 整合/集成/, bagging, boosting<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgf9b4cc0" class="outline-3">
<h3 id="orgf9b4cc0"><span class="section-number-3">9.2.</span> Numeric Prediction</h3>
</div>
</div>

<div id="outline-container-orgc84e1a9" class="outline-2">
<h2 id="orgc84e1a9"><span class="section-number-2">10.</span> Classification two steps</h2>
<div class="outline-text-2" id="text-10">
<ol class="org-ol">
<li>process 1: Model construction<br /></li>
<li>process 2: Using the Model in prediction<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orgadef8c0" class="outline-2">
<h2 id="orgadef8c0"><span class="section-number-2">11.</span> 分類演算法</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>評估指標<br /></li>
<li>作業：找出有漏洞程式碼資料集(有 Label 的)，找 Metrics 評估指標<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org13e7173" class="outline-2">
<h2 id="org13e7173"><span class="section-number-2">12.</span> Unsupervised Learning</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org9397934" class="outline-3">
<h3 id="org9397934"><span class="section-number-3">12.1.</span> Cluster Analysis</h3>
</div>
<div id="outline-container-org4b12335" class="outline-3">
<h3 id="org4b12335"><span class="section-number-3">12.2.</span> Algorithms</h3>
</div>
</div>

<div id="outline-container-org89f2119" class="outline-2">
<h2 id="org89f2119"><span class="section-number-2">13.</span> 類神經網路</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgbc8369c" class="outline-3">
<h3 id="orgbc8369c"><span class="section-number-3">13.1.</span> preceptron</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li>Weight<br /></li>
<li>Bias<br /></li>
<li>Activation function<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgf3ef254" class="outline-3">
<h3 id="orgf3ef254"><span class="section-number-3">13.2.</span> Activation</h3>
<div class="outline-text-3" id="text-13-2">
<p>
哪一種 function 最好：跑出來有效的就是好的<br />
</p>
<ul class="org-ul">
<li>Sigmoid function<br /></li>
<li>tanh<br /></li>
<li>ReLU<br /></li>
<li>Leaky ReLU<br /></li>
</ul>
</div>
</div>
