TF.org
** 重要關鍵
如果要實作 XOR，會發現無法實作出來，這個事實告訴我們，單一的 perceptron 無法完成所
有的任務，需要多層感知機:multiple-layer perceptron

** 具有學習能力的類神經網路
- 前述的 perceptron 是由我們手動填值，不算具有學習能力
- 如何建立 weight, bias 的初值：
  + 全部填 0
  + random
- 加上誤差函數
- 根據誤差函數，乘上一個學習率，將這些數值回饋給 perceptron，修正較佳的 weight,
  bias，如此重複迭代，直到誤差最小化

* 神經網路的基本步驟
** 如何計算誤差
*** error = 真正的值(t)-預測值(y)
*** 兩種類型
- \(E=\frac{1}{2}\Sigma_{i=1}^{n} (y_i-t_i)^2 \)
- \(E=-\Sigma_{i=1}^{n}t_i*\logy_i\)

深度學習最常用的損失函數為 cross entropy，典型公式為：\(-\Sigma{Y_k^{'} \times \log{(Y_i)}\)，預測的結果與數字影像真實值(label)間的誤差值均是以 one-hot encoding 表示。

** 類神經網路的 Back-Propagation
- 2018 年 Turing Prize 得主(Yoshua Bengio and Yann LeCun)
- \(\eta\) = 0.1 v.s. \(\lamda\)

* 梯度下降法
- 為何學習率不能設太大的圖示(TF2020 投影片 day 1, 2, p.49)
- 實作梯度下降法的演算法
- 最佳化問題(非線性關係)
- types:
  1. GD: 所有樣本都要算
  1. Batch GD: 不全部取，只取部份的點出來算(也許 50 個)
  1. Scotachtic GD: 隨機抽一個

* 優化器演算法
- Momentum，不叫動能？
- 學習率：應該要可以調整，一開始學比較慢，後續應該會越來越快(Adaptvie Learning
  Rates)
- 學習率公式：
  1. Adagrad: hiton 在上課時寫出來的, 較簡單
  1. RMSprop: 除以更多參數, 目前最常見
  1. Adam

* Tensorflow
- Tensor: N 維陣列+Flow
- 版本變動：不到半年升了三個版本，書會跟不上更新版本
- Tensorflow 1.X 版的問題：API 亂放,除錯困難，可能跑到快結束後才報錯誤, Tensorflow
  底層為 C++，上層為 Python
- Tensowflow 早期的高層為 tf-learn，但自從 Google 將 Keras 買下後，Keras 就成為最常用的
  上層為 python
- Tensorflow Estimator API, 因為 Tensorflow 所處理的數據太大，測試用資料集動軏成千
  上萬，所以：讀入的 function 要很有效率，所以影像變成一維陣列，所以要用 batch 的方
  式來跑，每次跑一點
- Transfer learning: 拿現成的 model，修改，用來預測自己要的東西
- Tensorflow Hub:
- 2019 年 10 月前的 tensorflow 都不要買
- 在 code 中看到 tf.placeholder(), global_initializer()的關鍵字都是 1.X 版的
_
** Tensor 資料型別
- scalar number
- vector
- matrix
- 3d

** Tensorflow 教材
*** Tutorials
*** [[https://tensorflow.org/tutorials][Tensorflow Tutorials]]
*** Keras
*** MIT: DEEP LEARNING
*** O'REILLY: 精通機器學習，蜥蜴
*** 台大：李宏易
p

* Keras
** 如何判斷 Keras
- import Keras v.s. import tf.keras
- 使用 Tensorflow 版的 Keras 的優勢：對於分散式的運算有較好的支援
** steps
*** 載入資料(google colab import google drive)
*** 資料預處理 (這個步驟其實是最重要也最困難的，因為資料處理的不好,如圖片模精，則後面 model 再好都沒用)
1. 歸一化
1. normalization
1. 大小不同的圖 -> resize -> 模糊 ->
*** build the model
*** config the model with losses
設定 loss function,
*** train the model
*** 評估準確度
** tensorflow 開發三種模式
1. Model (functional)
1. Sequential(堆積木)
1. 自建 model
** Model class API
#+begin_src python -r -n :results output :exports both
from keras.models import Model
from keras.layers import Input, Dense

a=Input(shape=(784,))
b = Dense(32)(a)

model = Model(inputs)
#+end_src
