TF.html
<div id="outline-container-orgef0cf14" class="outline-3">
<h3 id="orgef0cf14"><span class="section-number-3">13.3.</span> AND gate 實作</h3>
<div class="outline-text-3" id="text-13-3">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">coding: utf-8</span>
<span class="linenr"> 2: </span><span style="color: #51afef;">import</span> numpy <span style="color: #51afef;">as</span> np
<span class="linenr"> 3: </span><span style="color: #da8548; font-weight: bold;">3</span>
<span class="linenr"> 4: </span><span style="color: #51afef;">def</span> <span style="color: #c678dd;">AND</span>(x1, x2):
<span class="linenr"> 5: </span>    <span style="color: #dcaeea;">x</span> = np.array([x1, x2])
<span class="linenr"> 6: </span>    <span style="color: #dcaeea;">w</span> = np.array([<span style="color: #da8548; font-weight: bold;">0.5</span>, <span style="color: #da8548; font-weight: bold;">0.5</span>])
<span class="linenr"> 7: </span>    <span style="color: #dcaeea;">b</span> = -<span style="color: #da8548; font-weight: bold;">0.7</span>
<span class="linenr"> 8: </span>    <span style="color: #dcaeea;">tmp</span> = np.<span style="color: #c678dd;">sum</span>(w*x) + b
<span class="linenr"> 9: </span>    <span style="color: #51afef;">if</span> tmp &lt;= <span style="color: #da8548; font-weight: bold;">0</span>:
<span class="linenr">10: </span>        <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>
<span class="linenr">11: </span>    <span style="color: #51afef;">else</span>:
<span class="linenr">12: </span>        <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">1</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span><span style="color: #51afef;">if</span> <span style="color: #c678dd;">__name__</span> == <span style="color: #98be65;">'__main__'</span>:
<span class="linenr">15: </span>    <span style="color: #51afef;">for</span> xs <span style="color: #51afef;">in</span> [(<span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #da8548; font-weight: bold;">0</span>), (<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">0</span>), (<span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #da8548; font-weight: bold;">1</span>), (<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">1</span>)]:
<span class="linenr">16: </span>        y = AND(xs[<span style="color: #da8548; font-weight: bold;">0</span>], xs[<span style="color: #da8548; font-weight: bold;">1</span>])
<span class="linenr">17: </span>        <span style="color: #c678dd;">print</span>(<span style="color: #c678dd;">str</span>(xs) + <span style="color: #98be65;">" -&gt; "</span> + <span style="color: #c678dd;">str</span>(y))
</pre>
</div>

<pre class="example">
(0, 0) -&gt; 0
(1, 0) -&gt; 0
(0, 1) -&gt; 0
(1, 1) -&gt; 1
</pre>
</div>
</div>
<div id="outline-container-org6f00674" class="outline-3">
<h3 id="org6f00674"><span class="section-number-3">13.4.</span> Or gate 實作</h3>
<div class="outline-text-3" id="text-13-4">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">coding: utf-8</span>
<span class="linenr"> 2: </span><span style="color: #51afef;">import</span> numpy <span style="color: #51afef;">as</span> np
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #51afef;">def</span> <span style="color: #c678dd;">OR</span>(x1, x2):
<span class="linenr"> 5: </span>    <span style="color: #dcaeea;">x</span> = np.array([x1, x2])
<span class="linenr"> 6: </span>    <span style="color: #dcaeea;">w</span> = np.array([<span style="color: #da8548; font-weight: bold;">0.5</span>, <span style="color: #da8548; font-weight: bold;">0.5</span>])
<span class="linenr"> 7: </span>    <span style="color: #dcaeea;">b</span> = -<span style="color: #da8548; font-weight: bold;">0.3</span>
<span class="linenr"> 8: </span>    <span style="color: #dcaeea;">tmp</span> = np.<span style="color: #c678dd;">sum</span>(w*x) + b
<span class="linenr"> 9: </span>    <span style="color: #51afef;">if</span> tmp &lt;= <span style="color: #da8548; font-weight: bold;">0</span>:
<span class="linenr">10: </span>        <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">0</span>
<span class="linenr">11: </span>    <span style="color: #51afef;">else</span>:
<span class="linenr">12: </span>        <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">1</span>
<span class="linenr">13: </span>
<span class="linenr">14: </span><span style="color: #51afef;">if</span> <span style="color: #c678dd;">__name__</span> == <span style="color: #98be65;">'__main__'</span>:
<span class="linenr">15: </span>    <span style="color: #51afef;">for</span> xs <span style="color: #51afef;">in</span> [(<span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #da8548; font-weight: bold;">0</span>), (<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">0</span>), (<span style="color: #da8548; font-weight: bold;">0</span>, <span style="color: #da8548; font-weight: bold;">1</span>), (<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">1</span>)]:
<span class="linenr">16: </span>        y = OR(xs[<span style="color: #da8548; font-weight: bold;">0</span>], xs[<span style="color: #da8548; font-weight: bold;">1</span>])
<span class="linenr">17: </span>        <span style="color: #c678dd;">print</span>(<span style="color: #c678dd;">str</span>(xs) + <span style="color: #98be65;">" -&gt; "</span> + <span style="color: #c678dd;">str</span>(y))
<span class="linenr">18: </span>
</pre>
</div>

<pre class="example">
(0, 0) -&gt; 0
(1, 0) -&gt; 1
(0, 1) -&gt; 1
(1, 1) -&gt; 1
</pre>
</div>
</div>

<div id="outline-container-orgea302d7" class="outline-3">
<h3 id="orgea302d7"><span class="section-number-3">13.5.</span> 重要關鍵</h3>
<div class="outline-text-3" id="text-13-5">
<p>
如果要實作 XOR，會發現無法實作出來，這個事實告訴我們，單一的 perceptron 無法完成所<br />
有的任務，需要多層感知機:multiple-layer perceptron<br />
</p>
</div>
</div>

<div id="outline-container-org67d4507" class="outline-3">
<h3 id="org67d4507"><span class="section-number-3">13.6.</span> 具有學習能力的類神經網路</h3>
<div class="outline-text-3" id="text-13-6">
<ul class="org-ul">
<li>前述的 perceptron 是由我們手動填值，不算具有學習能力<br /></li>
<li>如何建立 weight, bias 的初值：<br />
<ul class="org-ul">
<li>全部填 0<br /></li>
<li>random<br /></li>
</ul></li>
<li>加上誤差函數<br /></li>
<li>根據誤差函數，乘上一個學習率，將這些數值回饋給 perceptron，修正較佳的 weight,<br />
bias，如此重複迭代，直到誤差最小化<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0200013" class="outline-2">
<h2 id="org0200013"><span class="section-number-2">14.</span> 神經網路的基本步驟</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orgb151524" class="outline-3">
<h3 id="orgb151524"><span class="section-number-3">14.1.</span> 如何計算誤差</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<ol class="org-ol">
<li><a id="org80d4648"></a>error = 真正的值(t)-預測值(y)<br /></li>
<li><a id="orgcd8e2e1"></a>兩種類型<br />
<div class="outline-text-4" id="text-14-1-2">
<ul class="org-ul">
<li>\(E=\frac{1}{2}\Sigma_{i=1}^{n} (y_i-t_i)^2 \)<br /></li>
<li>\(E=-\Sigma_{i=1}^{n}t_i*\logy_i\)<br /></li>
</ul>

<p>
深度學習最常用的損失函數為 cross entropy，典型公式為：\(-\Sigma{Y_k^{'} \times \log{(Y_i)}\)，預測的結果與數字影像真實值(label)間的誤差值均是以 one-hot encoding 表示。<br />
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org14398ca" class="outline-3">
<h3 id="org14398ca"><span class="section-number-3">14.2.</span> 類神經網路的 Back-Propagation</h3>
<div class="outline-text-3" id="text-14-2">
<ul class="org-ul">
<li>2018 年 Turing Prize 得主(Yoshua Bengio and Yann LeCun)<br /></li>
<li>\(\eta\) = 0.1 v.s. \(\lamda\)<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbd610e4" class="outline-2">
<h2 id="orgbd610e4"><span class="section-number-2">15.</span> 梯度下降法</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>為何學習率不能設太大的圖示(TF2020 投影片 day 1, 2, p.49)<br /></li>
<li>實作梯度下降法的演算法<br /></li>
<li>最佳化問題(非線性關係)<br /></li>
<li>types:<br />
<ol class="org-ol">
<li>GD: 所有樣本都要算<br /></li>
<li>Batch GD: 不全部取，只取部份的點出來算(也許 50 個)<br /></li>
<li>Scotachtic GD: 隨機抽一個<br /></li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-org3c5583c" class="outline-2">
<h2 id="org3c5583c"><span class="section-number-2">16.</span> 優化器演算法</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li>Momentum，不叫動能？<br /></li>
<li>學習率：應該要可以調整，一開始學比較慢，後續應該會越來越快(Adaptvie Learning<br />
Rates)<br /></li>
<li>學習率公式：<br />
<ol class="org-ol">
<li>Adagrad: hiton 在上課時寫出來的, 較簡單<br /></li>
<li>RMSprop: 除以更多參數, 目前最常見<br /></li>
<li>Adam<br /></li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-orgefade04" class="outline-2">
<h2 id="orgefade04"><span class="section-number-2">17.</span> Tensorflow</h2>
<div class="outline-text-2" id="text-17">
<ul class="org-ul">
<li>Tensor: N 維陣列+Flow<br /></li>
<li>版本變動：不到半年升了三個版本，書會跟不上更新版本<br /></li>
<li>Tensorflow 1.X 版的問題：API 亂放,除錯困難，可能跑到快結束後才報錯誤, Tensorflow<br />
底層為 C++，上層為 Python<br /></li>
<li>Tensowflow 早期的高層為 tf-learn，但自從 Google 將 Keras 買下後，Keras 就成為最常用的<br />
上層為 python<br /></li>
<li>Tensorflow Estimator API, 因為 Tensorflow 所處理的數據太大，測試用資料集動軏成千<br />
上萬，所以：讀入的 function 要很有效率，所以影像變成一維陣列，所以要用 batch 的方<br />
式來跑，每次跑一點<br /></li>
<li>Transfer learning: 拿現成的 model，修改，用來預測自己要的東西<br /></li>
<li>Tensorflow Hub:<br /></li>
<li>2019 年 10 月前的 tensorflow 都不要買<br /></li>
<li>在 code 中看到 tf.placeholder(), global_initializer()的關鍵字都是 1.X 版的<br /></li>
</ul>
<p>
_<br />
</p>
</div>
<div id="outline-container-orgaa601ac" class="outline-3">
<h3 id="orgaa601ac"><span class="section-number-3">17.1.</span> Tensor 資料型別</h3>
<div class="outline-text-3" id="text-17-1">
<ul class="org-ul">
<li>scalar number<br /></li>
<li>vector<br /></li>
<li>matrix<br /></li>
<li>3d<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org9f0b96b" class="outline-3">
<h3 id="org9f0b96b"><span class="section-number-3">17.2.</span> Tensorflow 教材</h3>
<div class="outline-text-3" id="text-17-2">
</div>
<ol class="org-ol">
<li><a id="org289a426"></a>Tutorials<br /></li>
<li><a id="org3620094"></a><a href="https://tensorflow.org/tutorials">Tensorflow Tutorials</a><br /></li>
<li><a id="orgeddca3e"></a>Keras<br /></li>
<li><a id="org9429cad"></a>MIT: DEEP LEARNING<br /></li>
<li><a id="org3c170d5"></a>O&rsquo;REILLY: 精通機器學習，蜥蜴<br /></li>
<li><a id="org2f6765e"></a>台大：李宏易<br />
<div class="outline-text-4" id="text-17-2-6">
<p>
p<br />
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org86a7679" class="outline-2">
<h2 id="org86a7679"><span class="section-number-2">18.</span> Keras</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-orgdbc82bf" class="outline-3">
<h3 id="orgdbc82bf"><span class="section-number-3">18.1.</span> 如何判斷 Keras</h3>
<div class="outline-text-3" id="text-18-1">
<ul class="org-ul">
<li>import Keras v.s. import tf.keras<br /></li>
<li>使用 Tensorflow 版的 Keras 的優勢：對於分散式的運算有較好的支援<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org9938ef1" class="outline-3">
<h3 id="org9938ef1"><span class="section-number-3">18.2.</span> steps</h3>
<div class="outline-text-3" id="text-18-2">
</div>
<ol class="org-ol">
<li><a id="org154ca19"></a>載入資料(google colab import google drive)<br /></li>
<li><a id="orga5b5b25"></a>資料預處理 (這個步驟其實是最重要也最困難的，因為資料處理的不好,如圖片模精，則後面 model 再好都沒用)<br />
<div class="outline-text-4" id="text-18-2-2">
<ol class="org-ol">
<li>歸一化<br /></li>
<li>normalization<br /></li>
<li>大小不同的圖 -&gt; resize -&gt; 模糊 -&gt;<br /></li>
</ol>
</div>
</li>
<li><a id="org4607f0a"></a>build the model<br /></li>
<li><a id="orga692317"></a>config the model with losses<br />
<div class="outline-text-4" id="text-18-2-4">
<p>
設定 loss function,<br />
</p>
</div>
</li>
<li><a id="org8dbac78"></a>train the model<br /></li>
<li><a id="orgde431eb"></a>評估準確度<br /></li>
</ol>
</div>
<div id="outline-container-orga73917d" class="outline-3">
<h3 id="orga73917d"><span class="section-number-3">18.3.</span> tensorflow 開發三種模式</h3>
<div class="outline-text-3" id="text-18-3">
<ol class="org-ol">
<li>Model (functional)<br /></li>
<li>Sequential(堆積木)<br /></li>
<li>自建 model<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org59853c7" class="outline-3">
<h3 id="org59853c7"><span class="section-number-3">18.4.</span> Model class API</h3>
<div class="outline-text-3" id="text-18-4">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr">1: </span><span style="color: #51afef;">from</span> keras.models <span style="color: #51afef;">import</span> Model
<span class="linenr">2: </span><span style="color: #51afef;">from</span> keras.layers <span style="color: #51afef;">import</span> Input, Dense
<span class="linenr">3: </span>
<span class="linenr">4: </span><span style="color: #dcaeea;">a</span>=Input(shape=(<span style="color: #da8548; font-weight: bold;">784</span>,))
<span class="linenr">5: </span>b = Dense(<span style="color: #da8548; font-weight: bold;">32</span>)(a)
<span class="linenr">6: </span>
<span class="linenr">7: </span>model = Model(inputs)
</pre>
</div>
</div>
</div>
