TF.org
** 用 Keras 來做剛剛的迴歸
** 何時用 function 式的寫法
multiple input v.s. mutlipel output, 這類 model 無法以 Sequentail 實作


** kernel density

* 20200613 #2/3

** 版本差異
*** 1.0: static computation graph: graph control flow
- 速度快，但當程式較長時不易 debut
*** 2.x: Dynamic control flow, 動態圖，使用 eager execution (Tensorfl
ow 1.4 後開始)
** 閱讀 Tensorflow
- [[https://www.tensorflow.org/api_docs/python/tf][Tensorflow API]]
- Tutorial
** TensorFlow Hub
- a library for reusable machine learning modules

* tf.data
** 資料預處理: tf.data.Dataset API
** TensorFlow 能接受的資料輸入(如圖片大小及色階)有固定

* Data is the king
** 資料太少？
Data augmentation
** 過度擬合
- Data augmentation: tf.keras.preprocessing.image.ImageDataGenerator()
- Data Dropout

* homework
1. tf.keras.layers.Conv2D()的各項參數說明 -> 簡報
1. 講義: p.212, 參考 code: Google TransorFlow 2.0
   1) 使用 CIFAR-10 資料集實驗三種 weight initilazation
   2) 實驗 Batch Normalization 方法

1. tf.keras.applications


* 比賽可以出的題目
- 芒果等級分類：將芒果分為 N 個等級
- 醫院依 X 光片預測是否有武漢肺炎：陽性(目前台灣可能有 400 張),另外可以找正常的樣本 20000 張，
- 工業暇疵品分類: 人工智慧的模組應用主要是在調參數；工業的產品(如晶片製造)也是在透過調整機器的參數在控制良率

* 感知機(Perceptron)
- 多層：一層以上就叫多層
  一層的例子：AND/OR gate [link]
- 何謂測度學習: 3-5 層

* RNN
與時間序列有關
Time series prediction
台灣某局處之地震分析
** Sequential pattern
-

* Book: Deep Learning
- [[https://www.books.com.tw/products/0010832030][輕鬆學會Google TensorFlow 2.0人工智慧深度學習實作開發]]
-
