TF.html
<div id="outline-container-org8a67818" class="outline-3">
<h3 id="org8a67818"><span class="section-number-3">18.5.</span> 用 Keras 來做剛剛的迴歸</h3>
</div>
<div id="outline-container-orgf8c3003" class="outline-3">
<h3 id="orgf8c3003"><span class="section-number-3">18.6.</span> 何時用 function 式的寫法</h3>
<div class="outline-text-3" id="text-18-6">
<p>
multiple input v.s. mutlipel output, 這類 model 無法以 Sequentail 實作<br />
</p>
</div>
</div>


<div id="outline-container-orgce4ffaf" class="outline-3">
<h3 id="orgce4ffaf"><span class="section-number-3">18.7.</span> kernel density</h3>
</div>
</div>

<div id="outline-container-org48387d5" class="outline-2">
<h2 id="org48387d5"><span class="section-number-2">19.</span> 20200613 #2/3</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-org8b05828" class="outline-3">
<h3 id="org8b05828"><span class="section-number-3">19.1.</span> 版本差異</h3>
<div class="outline-text-3" id="text-19-1">
</div>
<ol class="org-ol">
<li><a id="orgbda272f"></a>1.0: static computation graph: graph control flow<br />
<div class="outline-text-4" id="text-19-1-1">
<ul class="org-ul">
<li>速度快，但當程式較長時不易 debut<br /></li>
</ul>
</div>
</li>
<li><a id="orgbf6ed62"></a>2.x: Dynamic control flow, 動態圖，使用 eager execution (Tensorfl<br />
<div class="outline-text-4" id="text-19-1-2">
<p>
ow 1.4 後開始)<br />
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgad9873c" class="outline-3">
<h3 id="orgad9873c"><span class="section-number-3">19.2.</span> 閱讀 Tensorflow</h3>
<div class="outline-text-3" id="text-19-2">
<ul class="org-ul">
<li><a href="https://www.tensorflow.org/api_docs/python/tf">Tensorflow API</a><br /></li>
<li>Tutorial<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgcf9b522" class="outline-3">
<h3 id="orgcf9b522"><span class="section-number-3">19.3.</span> TensorFlow Hub</h3>
<div class="outline-text-3" id="text-19-3">
<ul class="org-ul">
<li>a library for reusable machine learning modules<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgca5bfd6" class="outline-2">
<h2 id="orgca5bfd6"><span class="section-number-2">20.</span> tf.data</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-org81cb5b1" class="outline-3">
<h3 id="org81cb5b1"><span class="section-number-3">20.1.</span> 資料預處理: tf.data.Dataset API</h3>
</div>
<div id="outline-container-orgae306f7" class="outline-3">
<h3 id="orgae306f7"><span class="section-number-3">20.2.</span> TensorFlow 能接受的資料輸入(如圖片大小及色階)有固定</h3>
</div>
</div>

<div id="outline-container-org8fff5d4" class="outline-2">
<h2 id="org8fff5d4"><span class="section-number-2">21.</span> Data is the king</h2>
<div class="outline-text-2" id="text-21">
</div>
<div id="outline-container-org5d675c6" class="outline-3">
<h3 id="org5d675c6"><span class="section-number-3">21.1.</span> 資料太少？</h3>
<div class="outline-text-3" id="text-21-1">
<p>
Data augmentation<br />
</p>
</div>
</div>
<div id="outline-container-org1a12e46" class="outline-3">
<h3 id="org1a12e46"><span class="section-number-3">21.2.</span> 過度擬合</h3>
<div class="outline-text-3" id="text-21-2">
<ul class="org-ul">
<li>Data augmentation: tf.keras.preprocessing.image.ImageDataGenerator()<br /></li>
<li>Data Dropout<br /></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org097d9c0" class="outline-2">
<h2 id="org097d9c0"><span class="section-number-2">22.</span> homework</h2>
<div class="outline-text-2" id="text-22">
<ol class="org-ol">
<li>tf.keras.layers.Conv2D()的各項參數說明 -&gt; 簡報<br /></li>
<li>講義: p.212, 參考 code: Google TransorFlow 2.0<br />
<ol class="org-ol">
<li>使用 CIFAR-10 資料集實驗三種 weight initilazation<br /></li>
<li>實驗 Batch Normalization 方法<br /></li>
</ol></li>

<li>tf.keras.applications<br /></li>
</ol>
</div>
</div>


<div id="outline-container-org56e3d44" class="outline-2">
<h2 id="org56e3d44"><span class="section-number-2">23.</span> 比賽可以出的題目</h2>
<div class="outline-text-2" id="text-23">
<ul class="org-ul">
<li>芒果等級分類：將芒果分為 N 個等級<br /></li>
<li>醫院依 X 光片預測是否有武漢肺炎：陽性(目前台灣可能有 400 張),另外可以找正常的樣本 20000 張，<br /></li>
<li>工業暇疵品分類: 人工智慧的模組應用主要是在調參數；工業的產品(如晶片製造)也是在透過調整機器的參數在控制良率<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgdf2b5a6" class="outline-2">
<h2 id="orgdf2b5a6"><span class="section-number-2">24.</span> 感知機(Perceptron)</h2>
<div class="outline-text-2" id="text-24">
<ul class="org-ul">
<li>多層：一層以上就叫多層<br />
一層的例子：AND/OR gate [link]<br /></li>
<li>何謂測度學習: 3-5 層<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org1f28df9" class="outline-2">
<h2 id="org1f28df9"><span class="section-number-2">25.</span> RNN</h2>
<div class="outline-text-2" id="text-25">
<p>
與時間序列有關<br />
Time series prediction<br />
台灣某局處之地震分析<br />
</p>
</div>
<div id="outline-container-org3397c3b" class="outline-3">
<h3 id="org3397c3b"><span class="section-number-3">25.1.</span> Sequential pattern</h3>
<div class="outline-text-3" id="text-25-1">
<ul class="org-ul">
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfad024d" class="outline-2">
<h2 id="orgfad024d"><span class="section-number-2">26.</span> Book: Deep Learning</h2>
<div class="outline-text-2" id="text-26">
<ul class="org-ul">
<li><a href="https://www.books.com.tw/products/0010832030">輕鬆學會Google TensorFlow 2.0人工智慧深度學習實作開發</a><br /></li>
<li></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yung-Chin Yen</p>
<p class="date">Created: 2022-07-04 Mon 09:21</p>
</div>
</body>
</html>
